<a href="https://colab.research.google.com/github/HameedGDataScientist/-hameedgdatascientist/blob/main/Pandas01.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [1]:
import numpy as np
import pandas as pd

In [2]:
country=['India','Pakistan','Bangladesh']
countrylist=pd.Series(country)
countrylist

0         India
1      Pakistan
2    Bangladesh
dtype: object

In [6]:
marks=[45,90,70,80]
subjects=['English','Maths','Urdu','Physics']
dateSheet=pd.Series(marks,index=subjects)
dateSheet

English    45
Maths      90
Urdu       70
Physics    80
dtype: int64

In [7]:
marks=[45,90,70,80]
subjects=['English','Maths','Urdu','Physics']
dateSheet=pd.Series(marks,index=subjects,name='Hameed Gul')
dateSheet

English    45
Maths      90
Urdu       70
Physics    80
Name: Hameed Gul, dtype: int64